original = [[1, 2], [3, 4], 10]
shallow = original.copy()
original.append(99) # змінюється тільки один список
print(original)
print(shallow)

original[0].append(777) # Змінюються обидва списки -
# тому що перший елемент оригінального списка - mutable;
# Якщо в першому елементі замість списку був би int - 
# перший елемент в копії не зміниться
original[2] = '111' # копія не зміниться
print(original)
print(shallow)

# елементи в списках - це ті ж самі обʼєкти
# або ж посилання на ті ж самі обʼєкти
# (в тому числі вкладені списки)
# але самі списки original/shallow - це різні обʼєкти